##################################################
##              [1] 파이썬 입출력                ##
##################################################

# print("\n" + "1.1. 개행, print 여러개 사용")
print("안녕하세요")
print("학습자님")
print("이번 회차도 수고하셨습니다")

# print("\n" + "1.2. 개행, 세미콜론 활용")
print("안녕하세요") ; print("학습자님") ; print("이번 회차도 수고하셨습니다")

# print("\n" + "1.3. 개행, 구분자 사용")
print("안녕하세요","학습자님","이번 회차도 수고하셨습니다.", sep='\n')


##################################################
##            2. 파이썬 입력 연산                ##
##################################################

# print("\n" + "2.1. 연산 출력")
a, b = 1, 2
print(a + b)

# print("\n" + "2.2. 입력값 출력")
a = int(input('값을 입력해주세요 : '))      # input 값은 type이 문자열이기 때문에 int 함수를 사용하여 type 변경
b = int(input('값을 입력해주세요 : '))      # input 값은 type이 문자열이기 때문에 int 함수를 사용하여 type 변경

print(a + b)

# print("\n" + "2.3. 반복 연산자(*) 활용")
a = '104'
print(3*a+a+a)


##################################################
##          3. 파이썬 여러줄 입력                ##
##################################################

# print("\n" + "3.1. \n 사용")
a = "안녕하세요 \n 학습자님 \n 이번 회차도 수고하셨습니다."

print(a)

# print("\n" + "3.2. """""" 사용")
b = """
안녕하세요
학습자님
이번 회차도 수고하셨습니다.
"""

print(b)
