##################################################
##              [3] 파이썬 튜플                  ##
##################################################

# print("\n" + "1.1. 튜플 선언")
t =()               # 소괄호()로  선언
t2 = tuple()        # tuple 함수로 선언

print(type(t))
print(type(t2))

# print("\n" + "1.2. 튜플 인덱스 값 유형")
t = (1,2,3,4)       
print(t)

t = (1,'문자',[1,2],(1,2))      # 정수(int), 문자열(string), 리스트(list), 튜플(tuple) 등 가능
print(t)


##################################################
##               2. 튜플  인덱싱                 ##
##################################################

# print("\n" + "2.1. 튜플 인덱싱")
print(t[0])         # 1번째 인덱스 값 출력 (1)
print(t[0:2])       # 1~2번째 인덱스 값 출력

l = [1,2,3]
l[0] = 2            # 리스트는 수정 가능
print(l)

# t = (1,2,3)
# t[0] = 2          # 튜플은 수정 불가
# print(t)


##################################################
##           Mission 1. 튜플값 변경             ##
##################################################

# print("\n" + "2.1. 튜플값 변경")
t = (1,2,3,4,5,6,7,8)

l = list(t)         # 튜플을 리스트 자료형으로 변경
print(l)

l[0] = '값 변경'     # 1번째 값을 '값 변경'으로 변경
print(l)

t = tuple(l)        # 리스트를 튜플 자료형으로 재변경
print(t)
