##################################################
##             [4] 파이썬 딕셔너리               ##
##################################################

# print("\n" + "1.1. 딕셔너리 선언")
d = {}              # 중괄호{}로 선언
d2 = dict()         # dict 함수로 선언

print(type(d))
print(type(d2))

# print("\n" + "1.2. 딕셔너리 입력")
d = {
    'a' : 1,
    'b' : 2
}
print(d)

# d = {
#     [1,2] : 1             # 변경 불가능한 객체가 와야되기 때문에 변경 가능한 리스트는 키 값 불가
# }
# print(d)

d = {
    (1,2) : 1               # 변경 불가능한 객체인 튜플은 키 값 가능
}
print(d)


##################################################
##              2. 딕셔너리 출력                 ##
##################################################

# print("\n" + "2.1. value 값")
d = { 'a' : 1 , 'b' : 2 }
print(d)
print(d['a'])               # d의 'a' 에 대한 value 출력

# print(d['c'])             # 존재하지 않는 key 입력 시 오류 발생

d['c']=3
print(d)
print(d['c'])

d['a'] = 100
print(d)

# print("\n" + "2.2. 딕셔너리 값 출력")
print(d.keys())             # key 값만 출력
print(d.values())           # value 값만 출력
print(d.items())            # 항목 모두 출력


##################################################
##         Mission 1. 딕셔너리 연산              ##
##################################################

# print("\n" + "3.1. 딕셔너리 병합")
dic1 = {'a' : 1 , 'b' : 2 , 'c' : 3}
dic2 = {'b' : 5 , 'c' : 1 , 'd' : 7}

dic1.update(dic2)       # dic1 에 dic2 의 값 덮어쓰기
print(dic1)             # 실행결과 = {'a' : 1 , 'b' : 5 , 'c' : 1 , 'd' : 7}
