##################################################
##              [10] 파이썬 함수                 ##
##################################################

# print("\n" + "1.1. 파이썬 함수")
def func(a, b):
    return 1
func(1, 2)


##################################################
##               2. 지역 변수                    ##
##################################################

# print("\n" + "2.1. 지역 변수")
def func():
    b = 10
    print(b)
func()


##################################################
##               3. 전역 변수                    ##
##################################################

# print("\n" + "3.1. 전역 변수")
a = 10
def func():
    print(a)
func()

def func():
    b= 20
    return a+b

x = func()
print(x)

# print("\n" + "3.2. global 키워드 사용")
a = 10
def func():
    global a
    a = 20
    print(a)

func()
print(a)


##################################################
##               4. 함수 값 전달                 ##
##################################################

# print("\n" + "4.1. 인자로 전달된 외부 변수의 값은 변경되지 않음")
a = 10
print(a)
def func(b):
    b = 20
    print(b)

func(a)         # func(b) 의 인자를 a로 변경해도 값은 20으로 동일
print(a)        # 외부 변수 a에 대한 값은 10으로 유지

# print("\n" + "4.2. 객체 요소 변경은 가능")
def func(b):
    b = [1, 2, 3]

a = [4, 5, 6]
func(a)
print(a)

def func(b):        # func(b) 함수는 b 인자의 1 번째 요소를 10으로 변경하는 함수
    b[1] = 10

a = [4, 5, 6]
func(a)             # a에 대한 값에 함수 적용하여, 1번째 요소를 10으로 변경
print(a)


##################################################
##                5. 매개 변수                   ##
##################################################

# print("\n" + "5.1. 기본 매개 변수")
def func(a, b=10):
    print(a+b)
func(10,20)
func(10)

# def func(a=10, b):  # 기본 값이 있는 매개 변수가 앞으로 올 수 없음
#     print(a+b)
# func(10, 20)

# print("\n" + "5.2. 키워드 매개 변수")
def func(a, b, c, d, e):
    print(a+b-c-d+e)

func(1,2,3,4,5)
func(5,4,3,2,1)

func(a=1, b=2, c=3, d=4, e=5)   # 각 변수 키워드에 값 대입

# print("\n" + "5.3. 가변 매개 변수")
def func(a, *arg):
    print(a, arg)

func(1)
func(2,3)
func(2,3,4,5,6)         # 가변 매개 변수에 대한 값은 튜플로 할당


##################################################
##          Mission 1. 매개변수 활용             ##
##################################################

def cal(a, b, c=0):
    if c == 0 :
        return a+b
    elif c == 1 :
        return a-b
    elif c == 2 :
        return a*b
    elif c == 3 :
        return a/b
    else :
        return None

print(cal(1,2,2))


##################################################
##        Mission 2. 가변 매개변수 활용           ##
##################################################

# def gugu(a):
#     for i in range(1,10):
#         print("{} X {} = {}".format(a, i, a*i))

# print(gugu(2))

def gugu(*a):
    for j in range(len(a)) :
        for i in range(1,10):
            print("{} X {} = {}".format(a[j], i, a[j]*i))

print(gugu(2, 3, 4, 5))
